xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_pwm.h
/**
  ******************************************************************************
  * @file    py32l090_hal_pwm.h
  * @author  MCU Application Team
  * @brief   Header file of PWM HAL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PY32L090_HAL_PWM_H
#define __PY32L090_HAL_PWM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32l090_hal_def.h"

/** @addtogroup PY32L090_HAL_Driver
  * @{
  */

/** @addtogroup PWM
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup PWM_Exported_Types PWM Exported Types
  * @{
  */

/**
  * @brief  PWM Time base Configuration Structure definition
  */
typedef struct
{
  uint32_t Prescaler;         /*!< Specifies the prescaler value used to divide the PWM clock.
                                   This parameter can be a number between Min_Data = 0x0000 and Max_Data = 0xFFFF */

  uint32_t CounterMode;       /*!< Specifies the counter mode.
                                   This parameter can be a value of @ref PWM_Counter_Mode */

  uint32_t Period;            /*!< Specifies the period value to be loaded into the active
                                   Auto-Reload Register at the next update event.
                                   This parameter can be a number between Min_Data = 0x0000 and Max_Data = 0xFFFF.  */

  uint32_t ClockDivision;     /*!< Specifies the clock division.
                                   This parameter can be a value of @ref PWM_ClockDivision */
  
  uint32_t AutoReloadPreload;  /*!< Specifies the auto-reload preload.
                                   This parameter can be a value of @ref PWM_AutoReloadPreload */
} PWM_Base_InitTypeDef;

/**
  * @brief  PWM Output Compare Configuration Structure definition
  */
typedef struct
{
  uint32_t OCMode;        /*!< Specifies the PWM mode.
                               This parameter can be a value of @ref PWM_PWM_modes */

  uint32_t Pulse;         /*!< Specifies the pulse value to be loaded into the Capture Compare Register.
                               This parameter can be a number between Min_Data = 0x0000 and Max_Data = 0xFFFF */

  uint32_t OCPolarity;    /*!< Specifies the output polarity.
                               This parameter can be a value of @ref PWM_Output_Compare_Polarity */

  uint32_t OCNPolarity;   /*!< Specifies the complementary output polarity.
                               This parameter can be a value of @ref PWM_Output_Compare_N_Polarity
                               @note This parameter is valid only for PWM instances supporting break feature. */

} PWM_OC_InitTypeDef;

/**
  * @brief  Clock Configuration Handle Structure definition
  */
typedef struct
{
  uint32_t ClockSource;     /*!< PWM clock sources
                                 This parameter can be a value of @ref PWM_Clock_Source */
  uint32_t ClockPolarity;   /*!< PWM clock polarity
                                 This parameter can be a value of @ref PWM_Clock_Polarity */
  uint32_t ClockPrescaler;  /*!< PWM clock prescaler
                                 This parameter can be a value of @ref PWM_Clock_Prescaler */
  uint32_t ClockFilter;     /*!< PWM clock filter
                                 This parameter can be a number between Min_Data = 0x0 and Max_Data = 0xF */
} PWM_ClockConfigTypeDef;

/**
  * @brief  PWM Break input and Dead time configuration Structure definition
  */
typedef struct
{
  uint32_t LockLevel;            /*!< PWM Lock level
                                      This parameter can be a value of @ref PWM_Lock_level */
  uint32_t DeadTime;             /*!< PWM dead Time
                                      This parameter can be a number between Min_Data = 0x00 and Max_Data = 0xFF */
  uint32_t BreakState;           /*!< PWM Break State
                                      This parameter can be a value of @ref PWM_Break_Input_enable_disable */
  uint32_t BreakPolarity;        /*!< PWM Break input polarity
                                      This parameter can be a value of @ref PWM_Break_Polarity */
  uint32_t AutomaticOutput;      /*!< PWM Automatic Output Enable state
                                      This parameter can be a value of @ref PWM_AOE_Bit_Set_Reset */
} PWM_BreakDeadTimeConfigTypeDef;

/**
  * @brief  HAL State structures definition
  */
typedef enum
{
  HAL_PWM_STATE_RESET             = 0x00U,    /*!< Peripheral not yet initialized or disabled  */
  HAL_PWM_STATE_READY             = 0x01U,    /*!< Peripheral Initialized and ready for use    */
  HAL_PWM_STATE_BUSY              = 0x02U,    /*!< An internal process is ongoing              */
  HAL_PWM_STATE_TIMEOUT           = 0x03U,    /*!< Timeout state                               */
  HAL_PWM_STATE_ERROR             = 0x04U     /*!< Reception process is ongoing                */
} HAL_PWM_StateTypeDef;

/**
  * @brief  HAL Active channel structures definition
  */
typedef enum
{
  HAL_PWM_ACTIVE_CHANNEL_1        = 0x01U,    /*!< The active channel is 1     */
  HAL_PWM_ACTIVE_CHANNEL_2        = 0x02U,    /*!< The active channel is 2     */
  HAL_PWM_ACTIVE_CHANNEL_3        = 0x04U,    /*!< The active channel is 3     */
  HAL_PWM_ACTIVE_CHANNEL_4        = 0x08U,    /*!< The active channel is 4     */
  HAL_PWM_ACTIVE_CHANNEL_CLEARED  = 0x00U     /*!< All active channels cleared */
} HAL_PWM_ActiveChannel;

/**
  * @brief  PWM Time Base Handle Structure definition
  */
#if (USE_HAL_PWM_REGISTER_CALLBACKS == 1)
typedef struct __PWM_HandleTypeDef
#else
typedef struct
#endif /* USE_HAL_PWM_REGISTER_CALLBACKS */
{
  PWM_TypeDef                 *Instance;     /*!< Register base address             */
  PWM_Base_InitTypeDef        Init;          /*!< PWM Time Base required parameters */
  HAL_PWM_ActiveChannel       Channel;       /*!< Active channel                    */
#if (defined(DMA) || defined(DMA1))
  DMA_HandleTypeDef           *hdma[7];      /*!< DMA Handlers array
                                                  This array is accessed by a @ref PWM_DMA_Handle_index */
#endif
  HAL_LockTypeDef             Lock;          /*!< Locking object                    */
  __IO HAL_PWM_StateTypeDef   State;         /*!< PWM operation state               */

#if (USE_HAL_PWM_REGISTER_CALLBACKS == 1)
  void (* Base_MspInitCallback)(struct __PWM_HandleTypeDef *hpwm);              /*!< PWM Base Msp Init Callback                              */
  void (* Base_MspDeInitCallback)(struct __PWM_HandleTypeDef *hpwm);            /*!< PWM Base Msp DeInit Callback                            */
  void (* PWM_MspInitCallback)(struct __PWM_HandleTypeDef *hpwm);               /*!< PWM PWM Msp Init Callback                               */
  void (* PWM_MspDeInitCallback)(struct __PWM_HandleTypeDef *hpwm);             /*!< PWM PWM Msp DeInit Callback                             */
  void (* PeriodElapsedCallback)(struct __PWM_HandleTypeDef *hpwm);             /*!< PWM Period Elapsed Callback                             */
  void (* PeriodElapsedHalfCpltCallback)(struct __PWM_HandleTypeDef *hpwm);     /*!< PWM Period Elapsed half complete Callback               */
  void (* PWM_PulseFinishedCallback)(struct __PWM_HandleTypeDef *hpwm);         /*!< PWM PWM Pulse Finished Callback                         */
  void (* PWM_PulseFinishedHalfCpltCallback)(struct __PWM_HandleTypeDef *hpwm); /*!< PWM PWM Pulse Finished half complete Callback           */
  void (* ErrorCallback)(struct __PWM_HandleTypeDef *hpwm);                     /*!< PWM Error Callback                                      */
  void (* BreakCallback)(struct __PWM_HandleTypeDef *hpwm);                     /*!< PWM Break Callback                                      */
#endif /* USE_HAL_PWM_REGISTER_CALLBACKS */
} PWM_HandleTypeDef;

#if (USE_HAL_PWM_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL PWM Callback ID enumeration definition
  */
typedef enum
{
  HAL_PWM_BASE_MSPINIT_CB_ID            = 0x00U    /*!< PWM Base MspInit Callback ID                              */
  ,HAL_PWM_BASE_MSPDEINIT_CB_ID          = 0x01U    /*!< PWM Base MspDeInit Callback ID                            */
  ,HAL_PWM_PWM_MSPINIT_CB_ID             = 0x06U    /*!< PWM PWM MspInit Callback ID                               */
  ,HAL_PWM_PWM_MSPDEINIT_CB_ID           = 0x07U    /*!< PWM PWM MspDeInit Callback ID                             */
  ,HAL_PWM_PERIOD_ELAPSED_CB_ID          = 0x0EU    /*!< PWM Period Elapsed Callback ID                             */
  ,HAL_PWM_PERIOD_ELAPSED_HALF_CB_ID     = 0x0FU    /*!< PWM Period Elapsed half complete Callback ID               */
  ,HAL_PWM_PWM_PULSE_FINISHED_CB_ID      = 0x15U    /*!< PWM PWM Pulse Finished Callback ID           */
  ,HAL_PWM_PWM_PULSE_FINISHED_HALF_CB_ID = 0x16U    /*!< PWM PWM Pulse Finished half complete Callback ID           */
  ,HAL_PWM_ERROR_CB_ID                   = 0x17U    /*!< PWM Error Callback ID                                      */
  ,HAL_PWM_BREAK_CB_ID                   = 0x1AU    /*!< PWM Break Callback ID                                      */
} HAL_PWM_CallbackIDTypeDef;

/**
  * @brief  HAL PWM Callback pointer definition
  */
typedef  void (*pPWM_CallbackTypeDef)(PWM_HandleTypeDef *hpwm);  /*!< pointer to the PWM callback function */

#endif /* USE_HAL_PWM_REGISTER_CALLBACKS */

/**
  * @}
  */
/* End of exported types -----------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup PWM_Exported_Constants PWM Exported Constants
  * @{
  */

#if (defined(DMA) || defined(DMA1))
/** @defgroup PWM_DMA_Base_address PWM DMA Base Address
  * @{
  */
#define PWM_DMABASE_CR1                    0x00000000U
#define PWM_DMABASE_CR2                    0x00000001U
#define PWM_DMABASE_SMCR                   0x00000002U
#define PWM_DMABASE_DIER                   0x00000003U
#define PWM_DMABASE_SR                     0x00000004U
#define PWM_DMABASE_EGR                    0x00000005U
#define PWM_DMABASE_CMR                    0x00000006U
#define PWM_DMABASE_CER                    0x00000008U
#define PWM_DMABASE_CNT                    0x00000009U
#define PWM_DMABASE_PSC                    0x0000000AU
#define PWM_DMABASE_ARR                    0x0000000BU
#define PWM_DMABASE_CCR1                   0x0000000DU
#define PWM_DMABASE_CCR2                   0x0000000EU
#define PWM_DMABASE_CCR3                   0x0000000FU
#define PWM_DMABASE_CCR4                   0x00000010U
#define PWM_DMABASE_BDTR                   0x00000011U
#define PWM_DMABASE_DCR                    0x00000012U
#define PWM_DMABASE_DMAR                   0x00000013U
/**
  * @}
  */
#endif

/** @defgroup PWM_Event_Source PWM Event Source
  * @{
  */
#define PWM_EVENTSOURCE_UPDATE              PWM_EGR_UG     /*!< Reinitialize the counter and generates an update of the registers */
/**
  * @}
  */

