xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_pwm.h
/** @defgroup PWM_ETR_Polarity PWM ETR Polarity
  * @{
  */
#define PWM_ETRPOLARITY_INVERTED              PWM_SMCR_ETP                      /*!< Polarity for ETR source */
#define PWM_ETRPOLARITY_NONINVERTED           0x00000000U                       /*!< Polarity for ETR source */
/**
  * @}
  */

/** @defgroup PWM_ETR_Prescaler PWM ETR Prescaler
  * @{
  */
#define PWM_ETRPRESCALER_DIV1                 0x00000000U                       /*!< No prescaler is used */
#define PWM_ETRPRESCALER_DIV2                 PWM_SMCR_ETPS_0                   /*!< ETR input source is divided by 2 */
#define PWM_ETRPRESCALER_DIV4                 PWM_SMCR_ETPS_1                   /*!< ETR input source is divided by 4 */
#define PWM_ETRPRESCALER_DIV8                 PWM_SMCR_ETPS                     /*!< ETR input source is divided by 8 */
/**
  * @}
  */

/** @defgroup PWM_Counter_Mode PWM Counter Mode
  * @{
  */
#define PWM_COUNTERMODE_UP                 0x00000000U                          /*!< Counter used as up-counter   */
#define PWM_COUNTERMODE_DOWN               PWM_CR1_DIR                          /*!< Counter used as down-counter */
#define PWM_COUNTERMODE_CENTERALIGNED1     PWM_CR1_CMS_0                        /*!< Center-aligned mode 1        */
#define PWM_COUNTERMODE_CENTERALIGNED2     PWM_CR1_CMS_1                        /*!< Center-aligned mode 2        */
#define PWM_COUNTERMODE_CENTERALIGNED3     PWM_CR1_CMS                          /*!< Center-aligned mode 3        */
/**
  * @}
  */

/** @defgroup PWM_ClockDivision PWM Clock Division
  * @{
  */
#define PWM_CLOCKDIVISION_DIV1             0x00000000U                          /*!< Clock division: tDTS=tCK_INT   */
#define PWM_CLOCKDIVISION_DIV2             PWM_CR1_CKD_0                        /*!< Clock division: tDTS=2*tCK_INT */
#define PWM_CLOCKDIVISION_DIV4             PWM_CR1_CKD_1                        /*!< Clock division: tDTS=4*tCK_INT */
/**
  * @}
  */

/** @defgroup PWM_Output_Compare_State PWM Output Compare State
  * @{
  */
#define PWM_OUTPUTSTATE_DISABLE            0x00000000U                          /*!< Compare 1 output disabled */
#define PWM_OUTPUTSTATE_ENABLE             PWM_CER_C1E                          /*!< Compare 1 output enabled */
/**
  * @}
  */

/** @defgroup PWM_AutoReloadPreload PWM Auto-Reload Preload
  * @{
  */
#define PWM_AUTORELOAD_PRELOAD_DISABLE                0x00000000U               /*!< PWMx_ARR register is not buffered */
#define PWM_AUTORELOAD_PRELOAD_ENABLE                 PWM_CR1_ARPE              /*!< PWMx_ARR register is buffered */

/**
  * @}
  */

/** @defgroup PWM_Output_Compare_N_State PWM Complementary Output Compare State
  * @{
  */
#define PWM_OUTPUTNSTATE_DISABLE           0x00000000U                          /*!< OCxN is disabled  */
#define PWM_OUTPUTNSTATE_ENABLE            PWM_CER_C1NE                         /*!< OCxN is enabled   */
/**
  * @}
  */

/** @defgroup PWM_Output_Compare_Polarity PWM Output Compare Polarity
  * @{
  */
#define PWM_OCPOLARITY_HIGH                0x00000000U                          /*!< Compare output polarity  */
#define PWM_OCPOLARITY_LOW                 PWM_CER_C1P                          /*!< Compare output polarity  */
/**
  * @}
  */

/** @defgroup PWM_Output_Compare_N_Polarity PWM Complementary Output Compare Polarity
  * @{
  */
#define PWM_OCNPOLARITY_HIGH               0x00000000U                          /*!< Compare complementary output polarity */
#define PWM_OCNPOLARITY_LOW                PWM_CER_C1NP                         /*!< Compare complementary output polarity */
/**
  * @}
  */

/** @defgroup PWM_Interrupt_definition PWM interrupt Definition
  * @{
  */
#define PWM_IT_UPDATE                      PWM_DIER_UIE                         /*!< Update interrupt            */
#define PWM_IT_OC1                         PWM_DIER_OC1IE                       /*!< Compare 1 interrupt */
#define PWM_IT_OC2                         PWM_DIER_OC2IE                       /*!< Compare 2 interrupt */
#define PWM_IT_OC3                         PWM_DIER_OC3IE                       /*!< Compare 3 interrupt */
#define PWM_IT_OC4                         PWM_DIER_OC4IE                       /*!< Compare 4 interrupt */
#define PWM_IT_BREAK                       PWM_DIER_BIE                         /*!< Break interrupt             */
/**
  * @}
  */

#if (defined(DMA) || defined(DMA1))
/** @defgroup PWM_DMA_sources PWM DMA Sources
  * @{
  */
#define PWM_DMA_UPDATE                     PWM_DIER_UDE                         /*!< DMA request is triggered by the update event */
#define PWM_DMA_OC1                        PWM_DIER_OC1DE                       /*!< DMA request is triggered by the compare macth 1 event */
#define PWM_DMA_OC2                        PWM_DIER_OC2DE                       /*!< DMA request is triggered by the compare macth 2 event */
#define PWM_DMA_OC3                        PWM_DIER_OC3DE                       /*!< DMA request is triggered by the compare macth 3 event */
#define PWM_DMA_OC4                        PWM_DIER_OC4DE                       /*!< DMA request is triggered by the compare macth 4 event */
/**
  * @}
  */
#endif

/** @defgroup PWM_Flag_definition PWM Flag Definition
  * @{
  */
#define PWM_FLAG_UPDATE                    PWM_SR_UIF                           /*!< Update interrupt flag */
#define PWM_FLAG_OC1                       PWM_SR_OC1IF                         /*!< Compare 1 interrupt flag */
#define PWM_FLAG_OC2                       PWM_SR_OC2IF                         /*!< Compare 2 interrupt flag */
#define PWM_FLAG_OC3                       PWM_SR_OC3IF                         /*!< Compare 3 interrupt flag */
#define PWM_FLAG_OC4                       PWM_SR_OC4IF                         /*!< Compare 4 interrupt flag */
#define PWM_FLAG_BREAK                     PWM_SR_BIF                           /*!< Break interrupt flag */
#define PWM_FLAG_CCR1OK                    PWM_SR_CCR1OK                        /*!< PWM_CCR1 register update completion flag */
#define PWM_FLAG_CCR2OK                    PWM_SR_CCR2OK                        /*!< PWM_CCR2 register update completion flag */
#define PWM_FLAG_CCR3OK                    PWM_SR_CCR3OK                        /*!< PWM_CCR3 register update completion flag */
#define PWM_FLAG_CCR4OK                    PWM_SR_CCR4OK                        /*!< PWM_CCR4 register update completion flag */
#define PWM_FLAG_CNTOK                     PWM_SR_CNTOK                         /*!< PWM_CNT register update completion flag */
#define PWM_FLAG_PSCOK                     PWM_SR_PSCOK                         /*!< PWM_PSC register update completion flag */
#define PWM_FLAG_ARROK                     PWM_SR_ARROK                         /*!< PWM_ARR register update completion flag */
/**
  * @}
  */

/** @defgroup PWM_Channel PWM Channel
  * @{
  */
#define PWM_CHANNEL_1                      0x00000000U                          /*!< compare channel 1 identifier      */
#define PWM_CHANNEL_2                      0x00000004U                          /*!< compare channel 2 identifier      */
#define PWM_CHANNEL_3                      0x00000008U                          /*!< compare channel 3 identifier      */
#define PWM_CHANNEL_4                      0x0000000CU                          /*!< compare channel 4 identifier      */
#define PWM_CHANNEL_ALL                    0x0000003CU                          /*!< Global compare channel identifier  */
/**
  * @}
  */

