xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_pwm.h
/** @defgroup PWM_Clock_Source PWM Clock Source
  * @{
  */
#define PWM_CLOCKSOURCE_ETRMODE     PWM_SMCR_ECE      /*!< External clock source mode                            */
#define PWM_CLOCKSOURCE_INTERNAL    0x00000000U       /*!< Internal clock source                                 */
/**
  * @}
  */

/** @defgroup PWM_Clock_Polarity PWM Clock Polarity
  * @{
  */
#define PWM_CLOCKPOLARITY_INVERTED           PWM_ETRPOLARITY_INVERTED           /*!< Polarity for ETRx clock sources */
#define PWM_CLOCKPOLARITY_NONINVERTED        PWM_ETRPOLARITY_NONINVERTED        /*!< Polarity for ETRx clock sources */
/**
  * @}
  */

/** @defgroup PWM_Clock_Prescaler PWM Clock Prescaler
  * @{
  */
#define PWM_CLOCKPRESCALER_DIV1                 PWM_ETRPRESCALER_DIV1           /*!< No prescaler is used                                                     */
#define PWM_CLOCKPRESCALER_DIV2                 PWM_ETRPRESCALER_DIV2           /*!< Prescaler for External ETR Clock: Capture performed once every 2 events. */
#define PWM_CLOCKPRESCALER_DIV4                 PWM_ETRPRESCALER_DIV4           /*!< Prescaler for External ETR Clock: Capture performed once every 4 events. */
#define PWM_CLOCKPRESCALER_DIV8                 PWM_ETRPRESCALER_DIV8           /*!< Prescaler for External ETR Clock: Capture performed once every 8 events. */
/**
  * @}
  */

/** @defgroup PWM_Lock_level  PWM Lock level
  * @{
  */
#define PWM_LOCKLEVEL_OFF                  0x00000000U                          /*!< LOCK OFF     */
#define PWM_LOCKLEVEL_1                    PWM_BDTR_LOCK_0                      /*!< LOCK Level 1 */
#define PWM_LOCKLEVEL_2                    PWM_BDTR_LOCK_1                      /*!< LOCK Level 2 */
#define PWM_LOCKLEVEL_3                    PWM_BDTR_LOCK                        /*!< LOCK Level 3 */
/**
  * @}
  */

/** @defgroup PWM_Break_Input_enable_disable PWM Break Input Enable
  * @{
  */
#define PWM_BREAK_ENABLE                   PWM_BDTR_BKE                         /*!< Break input BRK is enabled  */
#define PWM_BREAK_DISABLE                  0x00000000U                          /*!< Break input BRK is disabled */
/**
  * @}
  */

/** @defgroup PWM_Break_Polarity PWM Break Input Polarity
  * @{
  */
#define PWM_BREAKPOLARITY_LOW              0x00000000U                          /*!< Break input BRK is active low  */
#define PWM_BREAKPOLARITY_HIGH             PWM_BDTR_BKP                         /*!< Break input BRK is active high */
/**
  * @}
  */

/** @defgroup PWM_AOE_Bit_Set_Reset PWM Automatic Output Enable
  * @{
  */
#define PWM_AUTOMATICOUTPUT_DISABLE        0x00000000U                          /*!< MOE can be set only by software */
#define PWM_AUTOMATICOUTPUT_ENABLE         PWM_BDTR_AOE                         /*!< MOE can be set by software or automatically at the next update event 
                                                                                    (if none of the break inputs BRK and BRK2 is active) */
/**
  * @}
  */

/** @defgroup PWM_PWM_modes PWM Output Compare and PWM Modes
  * @{
  */
#define PWM_OCMODE_PWM1                     (PWM_CMR_OC1M_1 )                    /*!< PWM mode 1                             */
#define PWM_OCMODE_PWM2                     (PWM_CMR_OC1M_1 | PWM_CMR_OC1M_0)    /*!< PWM mode 2                             */
/**
  * @}
  */

#if (defined(DMA) || defined(DMA1))
/** @defgroup PWM_DMA_Burst_Length PWM DMA Burst Length
  * @{
  */
#define PWM_DMABURSTLENGTH_1TRANSFER       0x00000000U                          /*!< The transfer is done to 1 register starting from PWMx_CR1 + PWMx_DCR.DBA   */
#define PWM_DMABURSTLENGTH_2TRANSFERS      0x00000100U                          /*!< The transfer is done to 2 registers starting from PWMx_CR1 + PWMx_DCR.DBA  */
#define PWM_DMABURSTLENGTH_3TRANSFERS      0x00000200U                          /*!< The transfer is done to 3 registers starting from PWMx_CR1 + PWMx_DCR.DBA  */
#define PWM_DMABURSTLENGTH_4TRANSFERS      0x00000300U                          /*!< The transfer is done to 4 registers starting from PWMx_CR1 + PWMx_DCR.DBA  */
#define PWM_DMABURSTLENGTH_5TRANSFERS      0x00000400U                          /*!< The transfer is done to 5 registers starting from PWMx_CR1 + PWMx_DCR.DBA  */
#define PWM_DMABURSTLENGTH_6TRANSFERS      0x00000500U                          /*!< The transfer is done to 6 registers starting from PWMx_CR1 + PWMx_DCR.DBA  */
#define PWM_DMABURSTLENGTH_7TRANSFERS      0x00000600U                          /*!< The transfer is done to 7 registers starting from PWMx_CR1 + PWMx_DCR.DBA  */
#define PWM_DMABURSTLENGTH_8TRANSFERS      0x00000700U                          /*!< The transfer is done to 8 registers starting from PWMx_CR1 + PWMx_DCR.DBA  */
#define PWM_DMABURSTLENGTH_9TRANSFERS      0x00000800U                          /*!< The transfer is done to 9 registers starting from PWMx_CR1 + PWMx_DCR.DBA  */
#define PWM_DMABURSTLENGTH_10TRANSFERS     0x00000900U                          /*!< The transfer is done to 10 registers starting from PWMx_CR1 + PWMx_DCR.DBA */
#define PWM_DMABURSTLENGTH_11TRANSFERS     0x00000A00U                          /*!< The transfer is done to 11 registers starting from PWMx_CR1 + PWMx_DCR.DBA */
#define PWM_DMABURSTLENGTH_12TRANSFERS     0x00000B00U                          /*!< The transfer is done to 12 registers starting from PWMx_CR1 + PWMx_DCR.DBA */
#define PWM_DMABURSTLENGTH_13TRANSFERS     0x00000C00U                          /*!< The transfer is done to 13 registers starting from PWMx_CR1 + PWMx_DCR.DBA */
#define PWM_DMABURSTLENGTH_14TRANSFERS     0x00000D00U                          /*!< The transfer is done to 14 registers starting from PWMx_CR1 + PWMx_DCR.DBA */
#define PWM_DMABURSTLENGTH_15TRANSFERS     0x00000E00U                          /*!< The transfer is done to 15 registers starting from PWMx_CR1 + PWMx_DCR.DBA */
#define PWM_DMABURSTLENGTH_16TRANSFERS     0x00000F00U                          /*!< The transfer is done to 16 registers starting from PWMx_CR1 + PWMx_DCR.DBA */
#define PWM_DMABURSTLENGTH_17TRANSFERS     0x00001000U                          /*!< The transfer is done to 17 registers starting from PWMx_CR1 + PWMx_DCR.DBA */
#define PWM_DMABURSTLENGTH_18TRANSFERS     0x00001100U                          /*!< The transfer is done to 18 registers starting from PWMx_CR1 + PWMx_DCR.DBA */
/**
  * @}
  */

/** @defgroup PWM_DMA_Handle_index PWM DMA Handle Index
  * @{
  */
#define PWM_DMA_ID_UPDATE                ((uint16_t) 0x0000)       /*!< Index of the DMA handle used for Update DMA requests */
#define PWM_DMA_ID_OC1                   ((uint16_t) 0x0001)       /*!< Index of the DMA handle used for Compare 1 DMA requests */
#define PWM_DMA_ID_OC2                   ((uint16_t) 0x0002)       /*!< Index of the DMA handle used for Compare 2 DMA requests */
#define PWM_DMA_ID_OC3                   ((uint16_t) 0x0003)       /*!< Index of the DMA handle used for Compare 3 DMA requests */
#define PWM_DMA_ID_OC4                   ((uint16_t) 0x0004)       /*!< Index of the DMA handle used for Compare 4 DMA requests */
/**
  * @}
  */
#endif

/** @defgroup Channel_OC_State PWM Compare Channel State
  * @{
  */
#define PWM_OCx_ENABLE                   0x00000001U                            /*!< output channel is enabled */
#define PWM_OCx_DISABLE                  0x00000000U                            /*!< output channel is disabled */
#define PWM_OCxN_ENABLE                  0x00000004U                            /*!< Complementary output channel is enabled */
#define PWM_OCxN_DISABLE                 0x00000000U                            /*!< Complementary output channel is disabled */
/**
  * @}
  */

/**
  * @}
  */
/* End of exported constants -------------------------------------------------*/

/* Exported macros -----------------------------------------------------------*/
/** @defgroup PWM_Exported_Macros PWM Exported Macros
  * @{
  */

/** @brief  Reset PWM handle state.
  * @param  __HANDLE__ PWM handle.
  * @retval None
  */
#if (USE_HAL_PWM_REGISTER_CALLBACKS == 1)
#define __HAL_PWM_RESET_HANDLE_STATE(__HANDLE__) do {                                                        \
                                                      (__HANDLE__)->State             = HAL_PWM_STATE_RESET; \
                                                      (__HANDLE__)->Base_MspInitCallback         = NULL;     \
                                                      (__HANDLE__)->Base_MspDeInitCallback       = NULL;     \
                                                      (__HANDLE__)->PWM_MspInitCallback          = NULL;     \
                                                      (__HANDLE__)->PWM_MspDeInitCallback        = NULL;     \
                                                     } while(0)
#else
#define __HAL_PWM_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = HAL_PWM_STATE_RESET)
#endif /* USE_HAL_PWM_REGISTER_CALLBACKS */

/**
  * @brief  Enable the PWM peripheral.
  * @param  __HANDLE__ PWM handle
  * @retval None
  */
#define __HAL_PWM_ENABLE(__HANDLE__)                 ((__HANDLE__)->Instance->CR1|=(PWM_CR1_CEN))

/**
  * @brief  Enable the PWM main Output.
  * @param  __HANDLE__ PWM handle
  * @retval None
  */
#define __HAL_PWM_MOE_ENABLE(__HANDLE__)             ((__HANDLE__)->Instance->BDTR|=(PWM_BDTR_MOE))

/**
  * @brief  Disable the PWM peripheral.
  * @param  __HANDLE__ PWM handle
  * @retval None
  */
#define __HAL_PWM_DISABLE(__HANDLE__) \
  do { \
    if (((__HANDLE__)->Instance->CER & PWM_CER_CxE_MASK) == 0UL) \
    { \
      if(((__HANDLE__)->Instance->CER & PWM_CER_CxNE_MASK) == 0UL) \
      { \
        (__HANDLE__)->Instance->CR1 &= ~(PWM_CR1_CEN); \
      } \
    } \
  } while(0)

/**
  * @brief  Disable the PWM main Output.
  * @param  __HANDLE__ PWM handle
  * @retval None
  * @note The Main Output Enable of a pwm instance is disabled only if all the Cx and CxN channels have been disabled
  */
#define __HAL_PWM_MOE_DISABLE(__HANDLE__) \
  do { \
    if (((__HANDLE__)->Instance->CER & PWM_CER_CxE_MASK) == 0UL) \
    { \
      if(((__HANDLE__)->Instance->CER & PWM_CER_CxNE_MASK) == 0UL) \
      { \
        (__HANDLE__)->Instance->BDTR &= ~(PWM_BDTR_MOE); \
      } \
    } \
  } while(0)

/**
  * @brief  Disable the PWM main Output.
  * @param  __HANDLE__ PWM handle
  * @retval None
  * @note The Main Output Enable of a pwm instance is disabled unconditionally
  */
#define __HAL_PWM_MOE_DISABLE_UNCONDITIONALLY(__HANDLE__)  (__HANDLE__)->Instance->BDTR &= ~(PWM_BDTR_MOE)

/** @brief  Enable the specified PWM interrupt.
  * @param  __HANDLE__ specifies the PWM Handle.
  * @param  __INTERRUPT__ specifies the PWM interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg PWM_IT_UPDATE: Update interrupt
  *            @arg PWM_IT_OC1:   Compare 1 interrupt
  *            @arg PWM_IT_OC2:  Compare 2 interrupt
  *            @arg PWM_IT_OC3:  Compare 3 interrupt
  *            @arg PWM_IT_OC4:  Compare 4 interrupt
  *            @arg PWM_IT_BREAK: Break interrupt
  * @retval None
  */
#define __HAL_PWM_ENABLE_IT(__HANDLE__, __INTERRUPT__)    ((__HANDLE__)->Instance->DIER |= (__INTERRUPT__))

/** @brief  Disable the specified PWM interrupt.
  * @param  __HANDLE__ specifies the PWM Handle.
  * @param  __INTERRUPT__ specifies the PWM interrupt source to disable.
  *          This parameter can be one of the following values:
  *            @arg PWM_IT_UPDATE: Update interrupt
  *            @arg PWM_IT_OC1:   Compare 1 interrupt
  *            @arg PWM_IT_OC2:  Compare 2 interrupt
  *            @arg PWM_IT_OC3:  Compare 3 interrupt
  *            @arg PWM_IT_OC4:  Compare 4 interrupt
  *            @arg PWM_IT_BREAK: Break interrupt
  * @retval None
  */
#define __HAL_PWM_DISABLE_IT(__HANDLE__, __INTERRUPT__)   ((__HANDLE__)->Instance->DIER &= ~(__INTERRUPT__))

#if (defined(DMA) || defined(DMA1))
/** @brief  Enable the specified DMA request.
  * @param  __HANDLE__ specifies the PWM Handle.
  * @param  __DMA__ specifies the PWM DMA request to enable.
  *          This parameter can be one of the following values:
  *            @arg PWM_DMA_UPDATE: Update DMA request
  *            @arg PWM_DMA_OC1:   Compare 1 DMA request
  *            @arg PWM_DMA_OC2:  Compare 2 DMA request
  *            @arg PWM_DMA_OC3:  Compare 3 DMA request
  *            @arg PWM_DMA_OC4:  Compare 4 DMA request
  * @retval None
  */
#define __HAL_PWM_ENABLE_DMA(__HANDLE__, __DMA__)         ((__HANDLE__)->Instance->DIER |= (__DMA__))

