xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_pwm.h
/** @brief  Disable the specified DMA request.
  * @param  __HANDLE__ specifies the PWM Handle.
  * @param  __DMA__ specifies the PWM DMA request to disable.
  *          This parameter can be one of the following values:
  *            @arg PWM_DMA_UPDATE: Update DMA request
  *            @arg PWM_DMA_OC1:   Compare 1 DMA request
  *            @arg PWM_DMA_OC2:  Compare 2 DMA request
  *            @arg PWM_DMA_OC3:  Compare 3 DMA request
  *            @arg PWM_DMA_OC4:  Compare 4 DMA request
  * @retval None
  */
#define __HAL_PWM_DISABLE_DMA(__HANDLE__, __DMA__)        ((__HANDLE__)->Instance->DIER &= ~(__DMA__))
#endif

/** @brief  Check whether the specified PWM interrupt flag is set or not.
  * @param  __HANDLE__ specifies the PWM Handle.
  * @param  __FLAG__ specifies the PWM interrupt flag to check.
  *        This parameter can be one of the following values:
  *            @arg PWM_FLAG_UPDATE: Update interrupt flag
  *            @arg PWM_FLAG_OC1: Compare 1 interrupt flag
  *            @arg PWM_FLAG_OC2: Compare 2 interrupt flag
  *            @arg PWM_FLAG_OC3: Compare 3 interrupt flag
  *            @arg PWM_FLAG_OC4: Compare 4 interrupt flag
  *            @arg PWM_FLAG_BREAK: Break interrupt flag
  *            @arg PWM_FLAG_CCR1OK: PWM_CCR1 register update completion flag
  *            @arg PWM_FLAG_CCR2OK: PWM_CCR2 register update completion flag
  *            @arg PWM_FLAG_CCR3OK: PWM_CCR3 register update completion flag
  *            @arg PWM_FLAG_CCR4OK: PWM_CCR4 register update completion flag
  *            @arg PWM_FLAG_CNTOK: PWM_CNT register update completion flag
  *            @arg PWM_FLAG_PSCOK: PWM_PSC register update completion flag
  *            @arg PWM_FLAG_ARROK: PWM_ARR register update completion flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_PWM_GET_FLAG(__HANDLE__, __FLAG__)          (((__HANDLE__)->Instance->SR &(__FLAG__)) == (__FLAG__))

/** @brief  Clear the specified PWM interrupt flag.
  * @param  __HANDLE__ specifies the PWM Handle.
  * @param  __FLAG__ specifies the PWM interrupt flag to clear.
  *        This parameter can be one of the following values:
  *            @arg PWM_FLAG_UPDATE: Update interrupt flag
  *            @arg PWM_FLAG_OC1: Compare 1 interrupt flag
  *            @arg PWM_FLAG_OC2: Compare 2 interrupt flag
  *            @arg PWM_FLAG_OC3: Compare 3 interrupt flag
  *            @arg PWM_FLAG_OC4: Compare 4 interrupt flag
  *            @arg PWM_FLAG_BREAK: Break interrupt flag
  *            @arg PWM_FLAG_CCR1OK: PWM_CCR1 register update completion flag
  *            @arg PWM_FLAG_CCR2OK: PWM_CCR2 register update completion flag
  *            @arg PWM_FLAG_CCR3OK: PWM_CCR3 register update completion flag
  *            @arg PWM_FLAG_CCR4OK: PWM_CCR4 register update completion flag
  *            @arg PWM_FLAG_CNTOK: PWM_CNT register update completion flag
  *            @arg PWM_FLAG_PSCOK: PWM_PSC register update completion flag
  *            @arg PWM_FLAG_ARROK: PWM_ARR register update completion flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_PWM_CLEAR_FLAG(__HANDLE__, __FLAG__)        ((__HANDLE__)->Instance->SR = ~(__FLAG__))

/**
  * @brief  Check whether the specified PWM interrupt source is enabled or not.
  * @param  __HANDLE__ PWM handle
  * @param  __INTERRUPT__ specifies the PWM interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg PWM_IT_UPDATE: Update interrupt
  *            @arg PWM_IT_OC1:  Compare 1 interrupt
  *            @arg PWM_IT_OC2:  Compare 2 interrupt
  *            @arg PWM_IT_OC3:  Compare 3 interrupt
  *            @arg PWM_IT_OC4:  Compare 4 interrupt
  *            @arg PWM_IT_BREAK: Break interrupt
  * @retval The state of PWM_IT (SET or RESET).
  */
#define __HAL_PWM_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((((__HANDLE__)->Instance->DIER & (__INTERRUPT__)) \
                                                             == (__INTERRUPT__)) ? SET : RESET)

/** @brief Clear the PWM interrupt pending bits.
  * @param  __HANDLE__ PWM handle
  * @param  __INTERRUPT__ specifies the interrupt pending bit to clear.
  *          This parameter can be one of the following values:
  *            @arg PWM_IT_UPDATE: Update interrupt
  *            @arg PWM_IT_OC1:  Compare 1 interrupt
  *            @arg PWM_IT_OC2:  Compare 2 interrupt
  *            @arg PWM_IT_OC3:  Compare 3 interrupt
  *            @arg PWM_IT_OC4:  Compare 4 interrupt
  *            @arg PWM_IT_BREAK: Break interrupt
  * @retval None
  */
#define __HAL_PWM_CLEAR_IT(__HANDLE__, __INTERRUPT__)      ((__HANDLE__)->Instance->SR = ~(__INTERRUPT__))

/**
  * @brief  Indicates whether or not the PWM Counter is used as downcounter.
  * @param  __HANDLE__ PWM handle.
  * @retval False (Counter used as upcounter) or True (Counter used as downcounter)
  * @note This macro is particularly useful to get the counting mode when the pwm operates in Center-aligned mode or Encoder mode.
  */
#define __HAL_PWM_IS_PWM_COUNTING_DOWN(__HANDLE__)    (((__HANDLE__)->Instance->CR1 &(PWM_CR1_DIR)) == (PWM_CR1_DIR))

/**
  * @brief  Set the PWM Prescaler on runtime.
  * @param  __HANDLE__ PWM handle.
  * @param  __PRESC__ specifies the Prescaler new value.
  * @retval None
  */
#define __HAL_PWM_SET_PRESCALER(__HANDLE__, __PRESC__)       ((__HANDLE__)->Instance->PSC = (__PRESC__))

/**
  * @brief  Set the PWM Counter Register value on runtime.
  * @param  __HANDLE__ PWM handle.
  * @param  __COUNTER__ specifies the Counter register new value.
  * @retval None
  */
#define __HAL_PWM_SET_COUNTER(__HANDLE__, __COUNTER__)  ((__HANDLE__)->Instance->CNT = (__COUNTER__))

/**
  * @brief  Get the PWM Counter Register value on runtime.
  * @param  __HANDLE__ PWM handle.
  * @retval value of the pwm counter register 
  */
#define __HAL_PWM_GET_COUNTER(__HANDLE__)  ((__HANDLE__)->Instance->CNT)

/**
  * @brief  Set the PWM Autoreload Register value on runtime without calling another time any Init function.
  * @param  __HANDLE__ PWM handle.
  * @param  __AUTORELOAD__ specifies the Counter register new value.
  * @retval None
  */
#define __HAL_PWM_SET_AUTORELOAD(__HANDLE__, __AUTORELOAD__) \
  do{                                                    \
    (__HANDLE__)->Instance->ARR = (__AUTORELOAD__);  \
    (__HANDLE__)->Init.Period = (__AUTORELOAD__);    \
  } while(0)

/**
  * @brief  Get the PWM Autoreload Register value on runtime.
  * @param  __HANDLE__ PWM handle.
  * @retval value of the pwm auto-reload register(PWMx_ARR)
  */
#define __HAL_PWM_GET_AUTORELOAD(__HANDLE__)  ((__HANDLE__)->Instance->ARR)

/**
  * @brief  Set the PWM Clock Division value on runtime without calling another time any Init function.
  * @param  __HANDLE__ PWM handle.
  * @param  __CKD__ specifies the clock division value.
  *          This parameter can be one of the following value:
  *            @arg PWM_CLOCKDIVISION_DIV1: tDTS=tCK_INT
  *            @arg PWM_CLOCKDIVISION_DIV2: tDTS=2*tCK_INT
  *            @arg PWM_CLOCKDIVISION_DIV4: tDTS=4*tCK_INT
  * @retval None
  */
#define __HAL_PWM_SET_CLOCKDIVISION(__HANDLE__, __CKD__) \
  do{                                                   \
    (__HANDLE__)->Instance->CR1 &= (~PWM_CR1_CKD);  \
    (__HANDLE__)->Instance->CR1 |= (__CKD__);       \
    (__HANDLE__)->Init.ClockDivision = (__CKD__);   \
  } while(0)

/**
  * @brief  Get the PWM Clock Division value on runtime.
  * @param  __HANDLE__ PWM handle.
  * @retval The clock division can be one of the following values:
  *            @arg PWM_CLOCKDIVISION_DIV1: tDTS=tCK_INT
  *            @arg PWM_CLOCKDIVISION_DIV2: tDTS=2*tCK_INT
  *            @arg PWM_CLOCKDIVISION_DIV4: tDTS=4*tCK_INT
  */
#define __HAL_PWM_GET_CLOCKDIVISION(__HANDLE__)  ((__HANDLE__)->Instance->CR1 & PWM_CR1_CKD)

/**
  * @brief  Set the PWM Compare Register value on runtime without calling another time ConfigChannel function.
  * @param  __HANDLE__ PWM handle.
  * @param  __CHANNEL__ PWM Channels to be configured.
  *          This parameter can be one of the following values:
  *            @arg PWM_CHANNEL_1: PWM Channel 1 selected
  *            @arg PWM_CHANNEL_2: PWM Channel 2 selected
  *            @arg PWM_CHANNEL_3: PWM Channel 3 selected
  *            @arg PWM_CHANNEL_4: PWM Channel 4 selected
  * @param  __COMPARE__ specifies the Capture Compare register new value.
  * @retval None
  */
#define __HAL_PWM_SET_COMPARE(__HANDLE__, __CHANNEL__, __COMPARE__) \
  (((__CHANNEL__) == PWM_CHANNEL_1) ? ((__HANDLE__)->Instance->CCR1 = (__COMPARE__)) :\
   ((__CHANNEL__) == PWM_CHANNEL_2) ? ((__HANDLE__)->Instance->CCR2 = (__COMPARE__)) :\
   ((__CHANNEL__) == PWM_CHANNEL_3) ? ((__HANDLE__)->Instance->CCR3 = (__COMPARE__)) :\
   ((__HANDLE__)->Instance->CCR4 = (__COMPARE__)))

/**
  * @brief  Get the PWM Capture Compare Register value on runtime.
  * @param  __HANDLE__ PWM handle.
  * @param  __CHANNEL__ PWM Channel associated with the capture compare register
  *          This parameter can be one of the following values:
  *            @arg PWM_CHANNEL_1: get compare 1 register value
  *            @arg PWM_CHANNEL_2: get compare 2 register value
  *            @arg PWM_CHANNEL_3: get compare 3 register value
  *            @arg PWM_CHANNEL_4: get compare 4 register value
  * @retval value of the compare register
  */
#define __HAL_PWM_GET_COMPARE(__HANDLE__, __CHANNEL__) \
  (((__CHANNEL__) == PWM_CHANNEL_1) ? ((__HANDLE__)->Instance->CCR1) :\
   ((__CHANNEL__) == PWM_CHANNEL_2) ? ((__HANDLE__)->Instance->CCR2) :\
   ((__CHANNEL__) == PWM_CHANNEL_3) ? ((__HANDLE__)->Instance->CCR3) :\
   ((__HANDLE__)->Instance->CCR4))

/**
  * @brief  Set the PWM Output compare preload.
  * @param  __HANDLE__ PWM handle.
  * @param  __CHANNEL__ PWM Channels to be configured.
  *          This parameter can be one of the following values:
  *            @arg PWM_CHANNEL_1: PWM Channel 1 selected
  *            @arg PWM_CHANNEL_2: PWM Channel 2 selected
  *            @arg PWM_CHANNEL_3: PWM Channel 3 selected
  *            @arg PWM_CHANNEL_4: PWM Channel 4 selected
  * @retval None
  */
#define __HAL_PWM_ENABLE_OCxPRELOAD(__HANDLE__, __CHANNEL__)    \
  (((__CHANNEL__) == PWM_CHANNEL_1) ? ((__HANDLE__)->Instance->CMR |= PWM_CMR_OC1PE) :\
   ((__CHANNEL__) == PWM_CHANNEL_2) ? ((__HANDLE__)->Instance->CMR |= PWM_CMR_OC2PE) :\
   ((__CHANNEL__) == PWM_CHANNEL_3) ? ((__HANDLE__)->Instance->CMR |= PWM_CMR_OC3PE) :\
   ((__HANDLE__)->Instance->CMR |= PWM_CMR_OC4PE))

/**
  * @brief  Reset the PWM Output compare preload.
  * @param  __HANDLE__ PWM handle.
  * @param  __CHANNEL__ PWM Channels to be configured.
  *          This parameter can be one of the following values:
  *            @arg PWM_CHANNEL_1: PWM Channel 1 selected
  *            @arg PWM_CHANNEL_2: PWM Channel 2 selected
  *            @arg PWM_CHANNEL_3: PWM Channel 3 selected
  *            @arg PWM_CHANNEL_4: PWM Channel 4 selected
  * @retval None
  */
#define __HAL_PWM_DISABLE_OCxPRELOAD(__HANDLE__, __CHANNEL__)    \
  (((__CHANNEL__) == PWM_CHANNEL_1) ? ((__HANDLE__)->Instance->CMR &= ~PWM_CMR_OC1PE) :\
   ((__CHANNEL__) == PWM_CHANNEL_2) ? ((__HANDLE__)->Instance->CMR &= ~PWM_CMR_OC2PE) :\
   ((__CHANNEL__) == PWM_CHANNEL_3) ? ((__HANDLE__)->Instance->CMR &= ~PWM_CMR_OC3PE) :\
   ((__HANDLE__)->Instance->CMR &= ~PWM_CMR_OC4PE))

/**
  * @brief  Set the Update Request Source (URS) bit of the PWMx_CR1 register.
  * @param  __HANDLE__ PWM handle.
  * @note  When the URS bit of the PWMx_CR1 register is set, only counter
  *        overflow/underflow generates an update interrupt or DMA request (if
  *        enabled)
  * @note  Depending on devices and packages, DMA may not be available.
  *        Refer to device datasheet for DMA availability.
  * @retval None
  */
#define __HAL_PWM_URS_ENABLE(__HANDLE__)  ((__HANDLE__)->Instance->CR1|= PWM_CR1_URS)

/**
  * @brief  Reset the Update Request Source (URS) bit of the PWMx_CR1 register.
  * @param  __HANDLE__ PWM handle.
  * @note  When the URS bit of the PWMx_CR1 register is reset, any of the
  *        following events generate an update interrupt or DMA request (if
  *        enabled):
  *           _ Counter overflow underflow
  *           _ Setting the UG bit
  *           _ Update generation through the slave mode controller
  * @note  Depending on devices and packages, DMA may not be available.
  *        Refer to device datasheet for DMA availability.
  * @retval None
  */
#define __HAL_PWM_URS_DISABLE(__HANDLE__)  ((__HANDLE__)->Instance->CR1&=~PWM_CR1_URS)

/**
  * @}
  */
/* End of exported macros ----------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup PWM_Private_Constants PWM Private Constants
  * @{
  */
/* The counter of a pwm instance is disabled only if all the Cx and CxN
   channels have been disabled */
#define PWM_CER_CxE_MASK  ((uint32_t)(PWM_CER_C1E | PWM_CER_C2E | PWM_CER_C3E | PWM_CER_C4E))
#define PWM_CER_CxNE_MASK ((uint32_t)(PWM_CER_C1NE | PWM_CER_C2NE ))
/**
  * @}
  */
/* End of private constants --------------------------------------------------*/

