xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_hal_pwm.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup PWM_Private_Macros PWM Private Macros
  * @{
  */
#if (defined(DMA) || defined(DMA1))
#define IS_PWM_DMA_BASE(__BASE__) (((__BASE__) == PWM_DMABASE_CR1)   || \
                                   ((__BASE__) == PWM_DMABASE_CR2)   || \
                                   ((__BASE__) == PWM_DMABASE_SMCR)  || \
                                   ((__BASE__) == PWM_DMABASE_DIER)  || \
                                   ((__BASE__) == PWM_DMABASE_SR)    || \
                                   ((__BASE__) == PWM_DMABASE_EGR)   || \
                                   ((__BASE__) == PWM_DMABASE_CMR)   || \
                                   ((__BASE__) == PWM_DMABASE_CER)   || \
                                   ((__BASE__) == PWM_DMABASE_CNT)   || \
                                   ((__BASE__) == PWM_DMABASE_PSC)   || \
                                   ((__BASE__) == PWM_DMABASE_ARR)   || \
                                   ((__BASE__) == PWM_DMABASE_CCR1)  || \
                                   ((__BASE__) == PWM_DMABASE_CCR2)  || \
                                   ((__BASE__) == PWM_DMABASE_CCR3)  || \
                                   ((__BASE__) == PWM_DMABASE_CCR4)  || \
                                   ((__BASE__) == PWM_DMABASE_BDTR)  || \
                                   ((__BASE__) == PWM_DMABASE_DCR)   || \
                                   ((__BASE__) == PWM_DMABASE_DMAR))
#endif

#define IS_PWM_EVENT_SOURCE(__SOURCE__) ((((__SOURCE__) & 0xFFFFFFFEU) == 0x00000000U) && ((__SOURCE__) != 0x00000000U))

#define IS_PWM_COUNTER_MODE(__MODE__)      (((__MODE__) == PWM_COUNTERMODE_UP)              || \
                                            ((__MODE__) == PWM_COUNTERMODE_DOWN)            || \
                                            ((__MODE__) == PWM_COUNTERMODE_CENTERALIGNED1)  || \
                                            ((__MODE__) == PWM_COUNTERMODE_CENTERALIGNED2)  || \
                                            ((__MODE__) == PWM_COUNTERMODE_CENTERALIGNED3))

#define IS_PWM_CLOCKDIVISION_DIV(__DIV__)  (((__DIV__) == PWM_CLOCKDIVISION_DIV1) || \
                                            ((__DIV__) == PWM_CLOCKDIVISION_DIV2) || \
                                            ((__DIV__) == PWM_CLOCKDIVISION_DIV4))

#define IS_PWM_AUTORELOAD_PRELOAD(PRELOAD) (((PRELOAD) == PWM_AUTORELOAD_PRELOAD_DISABLE) || \
                                            ((PRELOAD) == PWM_AUTORELOAD_PRELOAD_ENABLE))

#define IS_PWM_OC_POLARITY(__POLARITY__)   (((__POLARITY__) == PWM_OCPOLARITY_HIGH) || \
                                            ((__POLARITY__) == PWM_OCPOLARITY_LOW))

#define IS_PWM_OCN_POLARITY(__POLARITY__)  (((__POLARITY__) == PWM_OCNPOLARITY_HIGH) || \
                                            ((__POLARITY__) == PWM_OCNPOLARITY_LOW))

#define IS_PWM_DMA_SOURCE(__SOURCE__) ((((__SOURCE__) & 0xFFFFE0FFU) == 0x00000000U) && ((__SOURCE__) != 0x00000000U))

#define IS_PWM_CHANNELS(__CHANNEL__)       (((__CHANNEL__) == PWM_CHANNEL_1) || \
                                            ((__CHANNEL__) == PWM_CHANNEL_2) || \
                                            ((__CHANNEL__) == PWM_CHANNEL_3) || \
                                            ((__CHANNEL__) == PWM_CHANNEL_4) || \
                                            ((__CHANNEL__) == PWM_CHANNEL_ALL))

#define IS_PWM_PERIOD(__PERIOD__) (((__PERIOD__) > 0U) && ((__PERIOD__) <= 0x0000FFFFU))
                                               
#define IS_PWM_COMPLEMENTARY_CHANNELS(__CHANNEL__) (((__CHANNEL__) == PWM_CHANNEL_1) || \
                                                    ((__CHANNEL__) == PWM_CHANNEL_2))

#define IS_PWM_CLOCKSOURCE(__CLOCK__) (((__CLOCK__) == PWM_CLOCKSOURCE_INTERNAL) || \
                                       ((__CLOCK__) == PWM_CLOCKSOURCE_ETRMODE))

#define IS_PWM_CLOCKPOLARITY(__POLARITY__) (((__POLARITY__) == PWM_CLOCKPOLARITY_INVERTED)    || \
                                            ((__POLARITY__) == PWM_CLOCKPOLARITY_NONINVERTED))

#define IS_PWM_CLOCKPRESCALER(__PRESCALER__) (((__PRESCALER__) == PWM_CLOCKPRESCALER_DIV1) || \
                                              ((__PRESCALER__) == PWM_CLOCKPRESCALER_DIV2) || \
                                              ((__PRESCALER__) == PWM_CLOCKPRESCALER_DIV4) || \
                                              ((__PRESCALER__) == PWM_CLOCKPRESCALER_DIV8))

#define IS_PWM_CLOCKFILTER(__ICFILTER__)      ((__ICFILTER__) <= 0xFU)

#define IS_PWM_LOCK_LEVEL(__LEVEL__)       (((__LEVEL__) == PWM_LOCKLEVEL_OFF) || \
                                            ((__LEVEL__) == PWM_LOCKLEVEL_1)   || \
                                            ((__LEVEL__) == PWM_LOCKLEVEL_2)   || \
                                            ((__LEVEL__) == PWM_LOCKLEVEL_3))

#define IS_PWM_BREAK_STATE(__STATE__)      (((__STATE__) == PWM_BREAK_ENABLE) || \
                                            ((__STATE__) == PWM_BREAK_DISABLE))

#define IS_PWM_BREAK_POLARITY(__POLARITY__) (((__POLARITY__) == PWM_BREAKPOLARITY_LOW) || \
                                             ((__POLARITY__) == PWM_BREAKPOLARITY_HIGH))

#define IS_PWM_AUTOMATIC_OUTPUT_STATE(__STATE__) (((__STATE__) == PWM_AUTOMATICOUTPUT_ENABLE) || \
                                                  ((__STATE__) == PWM_AUTOMATICOUTPUT_DISABLE))

#define IS_PWM_MSM_STATE(__STATE__)      (((__STATE__) == PWM_MASTERSLAVEMODE_ENABLE) || \
                                          ((__STATE__) == PWM_MASTERSLAVEMODE_DISABLE))

#define IS_PWM_PWM_MODE(__MODE__) (((__MODE__) == PWM_OCMODE_PWM1)               || \
                                   ((__MODE__) == PWM_OCMODE_PWM2))

#if (defined(DMA) || defined(DMA1))
#define IS_PWM_DMA_LENGTH(__LENGTH__)      (((__LENGTH__) == PWM_DMABURSTLENGTH_1TRANSFER) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_2TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_3TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_4TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_5TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_6TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_7TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_8TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_9TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_10TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_11TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_12TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_13TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_14TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_15TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_16TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_17TRANSFERS) || \
                                            ((__LENGTH__) == PWM_DMABURSTLENGTH_18TRANSFERS))

#define IS_PWM_DMA_DATA_LENGTH(LENGTH) (((LENGTH) >= 0x1U) && ((LENGTH) < 0x10000U))
#endif

#define IS_PWM_DEADPWME(__DEADPWME__)    ((__DEADPWME__) <= 0xFFU)

/**
  * @}
  */
/* End of private macros -----------------------------------------------------*/

